SaitovSP/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <registerRecords>InformationRegister.ИсторияОтказовОтБлюд</registerRecords>
  <registerRecords>InformationRegister.РезервСтолов</registerRecords>
  <registerRecords>AccumulationRegister.СуммаЗаказовКлиенты</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоЗаказовАкция</registerRecords>
  <attributes>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтола</name>
    <type>
      <types>CatalogRef.Столы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидочнаяКарта</name>
    <type>
      <types>CatalogRef.СкидочныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаСертификатом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатОплаты</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезерва</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовДляДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеУспешнойДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыдачиЗаказаКурьеру</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыБлюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Повар</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаОтБлюд</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/Catalogs/Блюда/Блюда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Блюда</name>
  <predefined>
    <items>
      <name>Сертификат</name>
      <description>Сертификат</description>
    </items>
  </predefined>
  <attributes>
    <name>ВесГотовогоБлюда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Калорийность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделМеню</name>
    <type>
      <types>EnumRef.РазделыМеню</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПриготовленияМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзменрения</name>
    <type>
      <types>CatalogRef.УчетнаяЕдиница</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ингридиенты</name>
    <attributes>
      <name>Ингридиент</name>
      <type>
        <types>CatalogRef.НоменклатураИнгридиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.УчетнаяЕдиница</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SaitovSP/src/Documents/Заказы/Forms/ФормаЗаказаНаДоставку/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыБлюда

&НаКлиенте
Процедура БлюдаБлюдоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Блюда.ТекущиеДанные;
	СТрокаТч.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	СтрокаТЧ.Количество = 1;
	//Проверяем выбранное значение на сертификат
	Если СтрокаТЧ.Блюдо = ПредопределенноеЗначение("Справочник.Блюда.Сертификат") Тогда
		ПоказатьОповещениеОВводеЦеныСертификата();
	КонецЕсли;
	//Установить цену текущего блбюда из регистра
	СтрокаТЧ.Цена = ОбщийСервер.ЦенаБлюда(ТекущаяДата(),СтрокаТЧ.Блюдо);
	//Расчитать сумму в строке
	ОбновитьДанные();
	//СтрокаТЧ.Статус = ОбщийСервер.СтатусЗаказа("ЗаказПринят");
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Доставка = Истина;
	Объект.Ресторан = ПараметрыСеанса.ТекущийРесторан;
	Если Параметры.Свойство("Официант") Тогда 
		Объект.Официант = Параметры.Официант;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОповещениеОВводеЦеныСертификата()
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЧисла", ЭтотОбъект);	
	ПоказатьВводЧисла( Оповещение,,"Введите номинал сертификата ",5);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЧисла(Результат, Параметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		СтрокаТЧ = Элементы.Блюда.ТекущиеДанные;
		СтрокаТЧ.Цена = Результат;
		ОбновитьДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные()

	СтрокаТЧ = ЭтаФорма.Элементы.Блюда.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммыВСтрокеТабличнойЧасти(СтрокаТЧ);
	
КонецПроцедуры
